# AssemblyDifferenceConfiguration Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyDifferenceConfiguration Properties
AssemblyDifferenceConfiguration Class See Also
---
The AssemblyDifferenceConfiguration type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from AssemblyDifference.) |

# See Also
AssemblyDifferenceConfiguration Class
Autodesk.Revit.DB Namespace